{"path":"bigcommerce-for-wordpress/getting-started/introduction","templateID":0,"sharedPropsHashes":{"nav":"Z2k7O5R","sidebarTree":"YoY00","namespace":"Zd6xn0"},"localProps":{"version":"1.3","crumbs":[{"content":"BigCommerce for WordPress","to":"/bigcommerce-for-wordpress"},{"content":"Getting Started","to":"/bigcommerce-for-wordpress/getting-started"},{"content":"Introduction","to":"/bigcommerce-for-wordpress/getting-started/introduction"}],"page":{"meta":{"title":"Introduction - Getting Started - BigCommerce for WordPress","url":"/bigcommerce-for-wordpress/getting-started/introduction","description":"\n\nIntroduction\n\n\n\nOn This Page\n\nHow It Works\n\n\n\nBigCommerce for WordPress allows you to power content-driven WordPress storefronts with the ecommerce fu..."},"title":"Introduction","parsedPath":["pages","/bigcommerce-for-wordpress","data","children",0,"data","children",0],"rootPagePath":"/bigcommerce-for-wordpress","path":"/bigcommerce-for-wordpress/getting-started/introduction","isSubpage":true,"route":{"path":"/introduction"},"data":{"blocks":[{"type":"text","data":"\r\n<div><h3 class=\"sub-docs-type\" id=\"bigcommerce-for-wordpress\">BigCommerce for Wordpress</h3>\r\n\r\n# Introduction\r\n<div class=\"otp\" id=\"no-index\">\r\n\r\n### On This Page\r\n- [How It Works](#how-it-works)\r\n\r\n</div>\r\n\r\nBigCommerce for WordPress allows you to power content-driven WordPress storefronts with the ecommerce functionality of BigCommerce. Product data is pulled into WordPress as a custom post type, giving you the freedom to embed products in posts and pages to create a tailored shopping experience. The plugin utilizes the full suite of BigCommerce APIs, allowing shoppers to seamlessly complete a purchase end-to-end on WordPress.\r\n\r\nYou can use the BigCommerce for WordPress plugin as a building block to create an ecommerce solution that’s unique to your brand. Whether you want to link multiple WordPress storefronts to a single BigCommerce store or extend the open source plugin to create custom-made solutions, BigCommerce for WordPress makes it easy to combine the power of BigCommerce with the flexible presentation of WordPress.\r\n\r\n## How It Works\r\n\r\nBigCommerce for WordPress connects your WordPress site to your BigCommerce store via API, and pulls all of the relevant data into a variety of database tables, some custom, some default WordPress. Products are a post type: product data is stored in the post table and product meta is stored in the post_meta table.\r\n\r\nOrders data is stored on the BigCommerce servers and is accessible in your WordPress site via API with custom code and via a nice UI in the BigCommerce admin. \r\n\r\nMost store options and settings are managed inside the BigCommerce UI, including Shipping, Taxes, and Payment Gateways.\r\n\r\n### Templating\r\n\r\nAll templates that render on the front end are found in the `/wp-content/plugins/bigcommerce/templates/public` directory. To\r\nOverride any template, create a `bigcommerce` directory in your theme and copy the template file to that directory.\r\n\r\nFor example, copy\r\n\r\n`wp-content/plugins/bigcommerce/templates/public/single-bigcommerce_product.php`\r\n\r\nto\r\n\r\n`wp-content/themes/<theme-name>/bigcommerce/single-bigcommerce_product.php`\r\n\r\nThen, edit `wp-content/themes/<theme-name>/bigcommerce/single-bigcommerce_product.php` to override the default content.\r\n\r\n**Note**: Most templates are used for rendering content inside of the content area of your theme's template. Only a few take over the entire page template. These may need modifications to match your theme.\r\n\r\n### Shopper Experience\r\n\r\nWhen a customer visits the store, the products they see are stored locally in WordPress. A cart is optional–when the customer clicks add-to-cart, they can either be directed to a cart page or delivered directly to the checkout page.\r\nWhen a shopper proceeds to checkout, they land on the BigCommerce checkout page in an embedded iframe, which can be styled to match your WordPress site. This creates a seamless experience for the shopper because they remain on your WordPress site and domain for the entire shopping experience. BigCommerce embedded checkout also allows you to leverage the built-in security and PCI-compliance of the BigCommerce checkout.\r\n\r\n### Channels\r\n\r\nChannels allow you to manage products in BigCommerce and sell them on other storefronts, like one or more WordPress sites, or in marketplaces, like Amazon and Facebook. A key concept is that the products listed on other channels are managed centrally from your BigCommerce store, so inventory is tracked neatly across all channels. This means that if all of your product ends up being sold through Amazon, your Facebook store will also be sold out.\r\n\r\n### WordPress as a Channel\r\n\r\nWhen using the WordPress plugin for BigCommerce, each connected WordPress site is considered another channel. This means that your WordPress store is aware of inventory levels, because those are monitored centrally in your BigCommerce store, and when an order is placed, it appears in the BigCommerce Order View UI along with orders received on other channels. Orders are labeled with the channel they originated from, to help you track sales data across multiple channels.\r\n\r\nWhile merchants traditionally sell primarily through their BigCommerce store and supplement with channels, it is possible to mask the main BigCommerce store and treat any given channel as the primary store. This would allow you to use WordPress as your primary store.\r\n"}],"children":[]}}}}
