{"path":"legacy/blueprint-themes/anatomy-of-a-theme","templateID":0,"sharedPropsHashes":{"nav":"Z2k7O5R","sidebarTree":"2rNxLf","namespace":"Zd6xn0"},"localProps":{"version":"1.3","crumbs":[{"content":"Legacy","to":"/legacy"},{"content":"Blueprint Themes","to":"/legacy/blueprint-themes"},{"content":"Anatomy of a Theme","to":"/legacy/blueprint-themes/anatomy-of-a-theme"}],"page":{"meta":{"title":"Anatomy of a Theme - Blueprint Themes - Legacy","url":"/legacy/blueprint-themes/anatomy-of-a-theme","description":"Anatomy of a Theme\n\n\n\nOn This Page\n\nDirectory Structure\n\nImages\n\nLayouts\n\nPanels\n\nSnippets\n\nStyles\n\n\n\nThemes are built using a powerful template system ..."},"title":"Anatomy of a Theme","parsedPath":["pages","/legacy","data","children",2,"data","children",1],"rootPagePath":"/legacy","path":"/legacy/blueprint-themes/anatomy-of-a-theme","isSubpage":true,"route":{"path":"/anatomy-of-a-theme"},"data":{"blocks":[{"type":"text","data":"# Anatomy of a Theme\r\n\r\n<div class=\"otp\" id=\"no-index\">\r\n\r\n### On This Page\r\n- [Directory Structure](#directory-structure)\r\n- [Images](#images)\r\n- [Layouts](#layouts)\r\n- [Panels](#panels)\r\n- [Snippets](#snippets)\r\n- [Styles](#styles)\r\n\r\n</div> \r\n\r\nThemes are built using a powerful template system that enables designers and developers familiar with CSS and HTML to modify the presentation and structure of a BigCommerce store.\r\n\r\n## Directory Structure\r\n\r\nTheme files that apply to a store design are organized in several different directories, as follows:\r\n\r\n*   **Images**\r\n*   **Panels**\r\n*   **Snippets**\r\n*   **Styles**\r\n\r\n## Images\r\n\r\nTheme specific static images (referenced from CSS, or in image tags).\r\n\r\n## Layouts\r\n\r\nLayout templates provide the base HTML structure that wraps storefront page content. Each layout file corresponds to a specific page.\r\n\r\nFor example, `product.html` refers to the page that’s shown when a customer is viewing the details of a product.\r\n\r\nMost layout files contain nothing more than references to individual panels to be shown on a page. These panels are contained in div tags that generally define left, center, or right columns of the page.\r\n\r\n## Panels\r\n\r\nPanels provide reusable blocks or dynamic sections of content.\r\n\r\nFor example, the `SideCategoryList` panel builds a list of categories to be shown throughout the store.\r\n\r\nPanels are generally referenced directly from layout templates. They define which content should be shown on a particular page and handle the generation of that specific content.\r\n\r\nSome panels contain strictly static content (such as the store name) whilst others generate content dynamically. Dynamically generated panels cannot be created ad-hoc as they are linked to specific data and logic within the application.\r\n\r\n## Snippets\r\n\r\nSnippets are templates containing a fragment of HTML that can be embedded multiple times in a page, either from direct references or from being part of a loop that iterates over the items in a list.\r\n\r\nFor example, the `HomeFeaturedProductsItem` snippet renders each individual product listed in the `HomeFeaturedProducts` panel.\r\n\r\n## Styles\r\n\r\nPrimary layout stylesheets for the Theme, with `styles.css` being the core file.\r\n"}],"children":[]}}}}
