{"path":"api-docs/partner/pos-solutions/channels","templateID":0,"sharedPropsHashes":{"nav":"Z2k7O5R","sidebarTree":"Z1Jm3fi","namespace":"Zd6xn0"},"localProps":{"version":"1.3","crumbs":[{"content":"API Docs","to":"/api-docs"},{"content":"Partner Information","to":"/api-docs/partner"},{"content":"POS Solutions","to":"/api-docs/partner/pos-solutions"},{"content":"Channels","to":"/api-docs/partner/pos-solutions/channels"}],"page":{"meta":{"title":"Channels - POS Solutions - Partner Information - API Docs","url":"/api-docs/partner/pos-solutions/channels","description":"BigCommerce Channels Overview\n\n\n\nOn this page\n\n\n\nChannels Toolkit\n\nChannel apps\n\nTypes of channels\n\nBuilding a channel app\n\nRelated resources\n\n\n\nBigComm..."},"title":"Channels","parsedPath":["pages","/api-docs","data","children",9,"data","children",3,"data","children",1],"rootPagePath":"/api-docs","path":"/api-docs/partner/pos-solutions/channels","isSubpage":true,"route":{"path":"/channels"},"data":{"blocks":[{"type":"text","data":"# BigCommerce Channels Overview\n\n<!-- Dev Center URL: https://developer.bigcommerce.com/api-docs/channels/guide/overview -->\n\n## On this page\n\n<div class=\"otp\" id=\"no-index\">\n\n - [Channels Toolkit](#channels-toolkit)\n - [Channel apps](#channel-apps)\n - [Types of channels](#types-of-channels)\n - [Building a channel app](#building-a-channel-app)\n - [Related resources](#related-resources)\n\n</div>\n\nBigCommerce's Channel Manager is the central place for merchants to discover, connect to, and manage their sales channels, including external channels like eBay, Amazon, Facebook, and Instagram. These external sales channels can extend the merchant's control panel experience in a number of ways, such as pushing orders from these external channels into the control panel alongside their BigCommerce storefront orders, allowing them to be fulfilled in the same way, and managing products on these channel from within the control panel in many of the same ways as they do for their BigCommerce storefronts.\n\nUsing BigCommerce's [Channels Toolkit](https://developer.bigcommerce.com/api-docs/channels/channels-toolkit-reference), any BigCommerce [partner](https://www.bigcommerce.com/partners/) can create and list a sales channel app on BigCommerce's [App Marketplace](https://www.bigcommerce.com/apps/) for any merchant to install. Additionally, approved apps developed by [select partners](https://www.bigcommerce.com/partners/) are marketed and discoverable from within the Channel Manager in every BigCommerce store's control panel.\n\nThis article provides a high-level overview of channels and channel apps on BigCommerce and introduces BigCommerce's Channels Toolkit. For an in-depth technical guide to developing BigCommerce sales channel apps, see [Building Channel Apps](https://developer.bigcommerce.com/api-docs/channels/building-channel-apps).\n\n## Channels Toolkit\n\nThe Channels Toolkit is a set of APIs, UI components, and patterns that provide partners and third-party developers with the ability to build integrations between BigCommerce and external sales channels. Currently, we consider sales channels to fall into four major groups:\n\n- Point-of-sale (POS) systems\n- Storefronts\n- Online marketplaces\n- Marketing platforms (including social networking sites)\n\nWith the Channels Toolkit, developers can quickly create an app that provides merchants the ability to manage the full experience of selling a product on both BigCommerce and an external platform, from listing products and running campaigns to receiving orders and fulfilling them. It also provides the ability to build apps that help merchants optimize their selling across channels, such as re-pricers and other related services.\n\nWhile external channel integrations were possible to build by third parties previously, the BigCommerce's Channels Toolkit provides additional capabilities that extend the functionality a third party can offer to merchants and the value that third parties can get from providing such integrations via BigCommerce.\n\n- **Big Design UI components** - These reusable components are built to be compatible with BigCommerce design guidelines and color palette, fully flexible, responsive, and accessible. They enable you to create an app that looks and feels native to BigCommerce, which ultimately allows merchants to scale their business as they can focus more on selling products and less on learning a new workflow every time they extend their offerings. BigDesign also enables you, as a technology partner, to launch your app more quickly, as it provides the building blocks and components needed to create a user experience. These components can be used for any type of app, not just channels.\n\n- **Channels and listings API endpoints** - These API endpoints allow product data to now be managed for specific channels and product listings, rather than just at the BigCommerce product catalog level. This includes overriding fields with different values, whether necessary for merchandising, external channel requirements, enabling a different language, or more. They also provide merchants with greater flexibility in creating differentiated shopping experiences, as they can track and analyze how their products are performing for each individual sales channel.\n\n- **Channel specific catalog management in the control panel** - Via new API endpoints, BigCommerce now supports the ability for merchants to list and manage products from within the BigCommerce control panel. Not only does this provide workflow improvements for merchants, but it enables partners to build more robust and complex integrations for external channels, as they are able to retrieve any channel and listing data that is relevant to a store.\n\nFor a comprehensive list of channel app development tools, see the [Channels Toolkit Reference](https://developer.bigcommerce.com/api-docs/channels/channels-toolkit-reference).\n\n## Channel apps\n\nBigCommerce channel apps allow merchants to list products on external sales channels like point-of-sale devices, online marketplaces, marketing platforms, and social networking sites. Using BigCommerce's [Channels Toolkit](https://developer.bigcommerce.com/api-docs/channels/channels-toolkit-reference), developers can create channel apps that integrate with virtually any platform. Once published and approved, these apps are discoverable on [BigCommerce's App Marketplace](https://www.bigcommerce.com/apps/) for merchants to install. Additionally, approved apps developed by [select partners](https://www.bigcommerce.com/partners/) are marketed within the Channel Manager in every BigCommerce store's control panel.\n\n### Discovery\n\nMerchants discover channel apps either through the [Apps Marketplace](https://www.bigcommerce.com/apps/) or\n\n![App Marketplace](https://storage.googleapis.com/bigcommerce-production-dev-center/images/channels/channels-marketplace.png \"App Marketplace\")\n\nthrough the Channel Manager (select partners).\n\n![Channel Manager](https://storage.googleapis.com/bigcommerce-production-dev-center/images/channels/channels-create-new-all-types.png \"Channel Manager\")\n\n### Display\n\nOur goal is to make it as easy as possible for merchants to manage and scale up their sales channels. As a result, we have made it possible for merchants to manage any of their sales channels, regardless of where they are marketed and discoverable, from a single source - the Channel Manager.\n\nWe enable this through our Channels API endpoints:\n\n- Allowing any app that is granted permission by the merchant during the install process to create a channel.\n- After an app creates a channel, the channel they create appears in the list of connected channels on the main manage screen of Channel Manager.\n\n![Channels in Channel Manager](https://storage.googleapis.com/bigcommerce-production-dev-center/images/channels/channels-channel-overview.png \"Channels in Channel Manager\")\n\n<div class=\"HubBlock--callout\">\n<div class=\"CalloutBlock--info\">\n<div class=\"HubBlock-content\">\n<!-- theme: info -->\n\n> **Note**\n>\n> - BigCommerce has control of which platforms and types are available to create. It is currently a manual process to add new platforms. A channel instance can be only 1 type; however, a channel app can register multiple different channels.\n>\n> - For channel apps that are strategically approved ([select partners](https://developer.bigcommerce.com/api-docs/partner/becoming-a-partner)), the app appears as an option when adding a new channel. This starts the app install process.\n\n</div>\n</div>\n</div>\n\n### Management\n\nOnce installed, merchants manage channel apps via Channel Manager in the control panel. This includes status and key channel settings surfaced by channel apps via Channels API endpoints.\n\n![Edit Channel Settings](https://storage.googleapis.com/bigcommerce-production-dev-center/images/channels/channels-edit-settings.png \"Edit Channel Settings\")\n\n<div class=\"HubBlock--callout\">\n<div class=\"CalloutBlock--info\">\n<div class=\"HubBlock-content\">\n \n> **Note**\n>\n> Apps provided by partners who don't use the Channel API will only appear in the App Marketplace and **My Apps**.\n\nOn the **View Products** page, merchants can list products on any installed channel that supports per-product listing capabilities.\n\n</div>\n</div>\n</div>\n\n![List Product](https://storage.googleapis.com/bigcommerce-production-dev-center/images/channels/channels-view-products.png \"List Product\")\n\nMerchants can also list products from the product edit page.\n\n![Manage Channel Assignment](https://storage.googleapis.com/bigcommerce-production-dev-center/images/channels/channels-all-assignments.png \"Manage Channel Assignment\")\n\n<div class=\"HubBlock--callout\">\n<div class=\"CalloutBlock--info\">\n<div class=\"HubBlock-content\">\n \n> **Note**\n>\n> Not all channel apps can or should support per product listing capabilities; determining if this functionality is appropriate and useful is up to the app developer.\n\n</div>\n</div>\n</div>\n\n## Types of channels\n\nYou can use the toolkit to build channel apps for all types of channels.\n\n### Storefront\n\nA platform that enables merchants to power an online storefront outside of BigCommerce for selling their products. The fundamentals and core technology driving the Channels Toolkit for Storefronts is also what powers internal BigCommerce storefronts.\n\nExamples:\n\n- WordPress\n- Bloomreach\n- Acquia\n- Drupal\n\n### Point of sale (POS)\n\nA physical system used by merchants to process transactions, maintain their product catalog, track customers, and more.\n\nExamples:\n\n- Springboard\n- Bindo\n- Vend\n\n### Marketplaces\n\nA platform where merchants list their catalog and sell their products, with transactions processed by the marketplace platform.\n\nExamples:\n\n- Amazon\n- eBay\n- Facebook Marketplace\n- Jet\n- Walmart\n\n### Marketing\n\nA platform on which merchants communicate their brand and products with their shopper base, seeking to drive discovery and conversion. These channels don't support checkout directly.\n\nExamples:\n\n- Facebook Ads\n- Google Shopping\n- WordPress Blog\n- Pinterest\n- Instagram\n\n## Building a channel app\n\nAny partner can build a channel app on BigCommerce.\n\nAll partners\n\n- More seamless integration within the BigCommerce control panel that looks and feels native due to following BigCommerce patterns and being more deeply integrated within core parts of the BC control panel\n- Increased functionality that gives greater flexibility in building robust sales channel apps, which hopefully increases adoption and revenue\n\nSelect partners\n\n- Merchant marketing and discovery within the Channel Manager\n- Ability to be promoted more highly within the Channel Manager \"Add New Channel\" section\n- Ability to be promoted within control panel dashboard\n\n### Getting started\n\nIf you're not already a partner and familiar with the BigCommerce APIs and tools you need to get started, you'll need to:\n\n1. [Become a partner](https://developer.bigcommerce.com/api-docs/partner/becoming-a-partner)\n2. [Get acquainted with our APIs](https://developer.bigcommerce.com/api-docs/getting-started/about-our-api)\n3. Sign up for developer account\n4. Start a free trial\n\n### Building the app\n\nOnce you're ready to get started developing the channel app, see [Building Channel Apps](https://developer.bigcommerce.com/api-docs/channels/building-channel-apps) for a comprehensive guide.\n\n## Related resources\n\n### Articles\n\n- [Building Channels Quick Start](https://developer.bigcommerce.com/api-docs/channels/quick-start)\n\n<!--stackedit_data:\neyJoaXN0b3J5IjpbNzMwOTk4MTE2XX0=\n-->\n<!--stackedit_data:\neyJoaXN0b3J5IjpbODgxMjY3NTkxLC04OTM4NTIxODMsNzMwOT\nk4MTE2XX0=\n-->\n"}],"children":[]}}}}
