{"path":"api-docs/providers/tax","templateID":0,"sharedPropsHashes":{"nav":"Z2k7O5R","sidebarTree":"Z1Jm3fi","namespace":"Zd6xn0"},"localProps":{"version":"1.3","crumbs":[{"content":"API Docs","to":"/api-docs"},{"content":"Provider APIs","to":"/api-docs/providers"},{"content":"Tax Providers","to":"/api-docs/providers/tax"}],"page":{"meta":{"title":"Tax Providers - Provider APIs - API Docs","url":"/api-docs/providers/tax","description":"Tax Provider API\n\n\n\nOn this Page\n\nObtaining an app ID\n\nSharing provider details with BigCommerce\n\nBuilding the app\n\nInstalling the app\n\nEstablishing a c..."},"title":"Tax Providers","parsedPath":["pages","/api-docs","data","children",3,"data","children",1],"rootPagePath":"/api-docs","path":"/api-docs/providers/tax","isSubpage":true,"route":{"path":"/tax"},"data":{"blocks":[{"type":"text","data":"# Tax Provider API\n\n<div class=\"otp\" id=\"no-index\">\n\n### On this Page\n\n- [Obtaining an app ID](#obtaining-an-app-id)\n- [Sharing provider details with BigCommerce](#sharing-provider-details-with-bigcommerce)\n- [Building the app](#building-the-app)\n- [Installing the app](#installing-the-app)\n- [Establishing a connection](#establishing-a-connection)\n- [Enabling tax providers in the control panel](#enabling-tax-providers-in-the-control-panel)\n- [Tax estimation](#tax-estimation)\n- [Document submission](#document-submission)\n- [Testing](#testing)\n- [Support](#support)\n- [Related resources](#related-resources)\n\n</div>\n\nThe [Tax Provider API](https://developer.bigcommerce.com/api-reference/providers/tax-provider-api) allows you to provide business-to-consumer sales tax estimates to shoppers on the storefront and to merchants in the control panel; it can also be used to submit documents for tax reconciliation purposes.\n\nThe [Tax Provider API](https://developer.bigcommerce.com/api-reference/providers/tax-provider-api) works in conjunction with a BigCommerce app, so you will need to [build an app](https://developer.bigcommerce.com/api-docs/apps/guide/intro) that integrates the [Tax Provider API](https://developer.bigcommerce.com/api-reference/providers/tax-provider-api).\n\nMulti-tenant tax providers can choose to publish their BigCommerce app so that it's discoverable by anyone, or publish their app as unlisted so that it can only be installed via URL. Furthermore, tax solutions that have been built in-house or for specific merchants by digital agencies are also supported as private instances, and will only work on the specified stores.\n\n\n## Obtaining an app ID\n\nTo get your app ID, start creating an app in the [Developer Portal](https://devtools.bigcommerce.com/), and fill out the information on [Step 3 Technical](https://developer.bigcommerce.com/api-docs/apps/guide/publishing#add-technical-information). In the URL, you will see your unique app ID.\n\n[Learn more about finding your app's ID](https://developer.bigcommerce.com/api-docs/apps/tutorials/id).\n\n## Sharing provider details with BigCommerce\n\nOnce you've obtained your app ID, please share your app ID as well as the below information with BigCommerce by emailing [taxproviderapi@bigcommerce.com](mailto:taxproviderapi@bigcommerce.com). This allows us to create your tax provider configuration, which will take approximately 5 days.\n\nOnce your tax provider configuration is ready, we'll let you know via email. The email will also include your `provider_id` which is required when [establishing a connection](#establishing-a-connection) with the [Tax Provider API](https://developer.bigcommerce.com/api-reference/providers/tax-provider-api).\n\n\n</br>\n\n|Tax Provider Details              |Required / Optional            |Value(s)                     |Description                                                                                           |Example                                           |\n| ------------------------------------- | ------------------------------ | ---------------------------- | ----------------------------------------------------------------------------------------------------- | ------------------------------------------------- |\n| App ID                                | Required                       | Integer                      | Tells us which tax provider configuration to use after the app is installed.                                     | `123456`                                          |\n| Tax provider name                     | Required                       | String                       | Displayed in the BigCommerce control panel (e.g. **Store Setup > Tax > Add Tax Service**).             | `Sample Tax`                                      |\n| Tax provider type                     | Required                       | Production, Sandbox             | Hierarchy of tax provider configurations, Production is primary and Sandboxes are secondary, see [sandbox tax provider configuration](#sandbox-tax-provider-configuration) for more information.               | `Production`                                      |\n| Partner support email                | Required                       | Email                        | Used by BigCommerce to contact tax provider, in the case we need to forward a merchant support request.                       | `support@sampletax.example.com`                   |\n| Links displayed in control panel                  | Optional                       | URL, Title, Description                          | Link(s) displayed to shoppers when they navigate to **Store Setup > Tax > {Tax Provider}**. One or multiple links supported.                        | `support.sampletax.com`, `Sample Tax Support`, `The Sample Tax Support website.`                    |\n| **Coverage**                          |                                |                              |                                                                                                       |                                                   |\n| Tax provider visibility               | Required                       | Show, Hide                   | Tells us if tax provider should be displayed to users in the BigCommerce control panel before the tax providers app is installed on the associated store.          | `Show`                                            |\n| Platform availability                    | Required                       | All stores, Private instance | Tells us if tax provider should work on all stores or only on the stores where a store hash has been provided.                                           | `All stores`                                      |\n| Supported store(s) | Required if platform availability is **private instance**) | Store hashes                 | As a private instance, tax provider configuration will only work on store hashes provided.                      | `dwvjntfqv,epq54yymgq`                            |\n| Supported / unsupported countries     | Required                       | ISO 3166-1 alpha-2           | Comma separated ISO 3166-1 alpha-2 country codes for supported countries.                             | `US,CA,GB,FR,AU,NZ`                               |\n| **URLs**                              |                                |                              |                                                                                                       |                                                   |\n| Estimate URL                          | Required                       | URL                          | URL BigCommerce should use for Tax Provider API estimate requests.                                    | `https://sampletax.example.com/tax/estimate`      |\n| Commit URL                            | Optional                       | URL                          | URL BigCommerce should use for Tax Provider API quote requests.                                       | `https://sampletax.example.com/doc/commit`        |\n| Adjust URL                            | Optional                       | URL                          | URL BigCommerce should use for Tax Provider API quote requests.                                       | `https://sampletax.example.com/doc/adjust`        |\n| Void URL                              | Optional                       | URL                          | URL BigCommerce should use for Tax Provider API quote requests.                                       | `https://sampletax.example.com/doc/void`          |\n| **Testing**                               |                                |                              |                                                                                                       |                                                   |\n| Partner sandbox store domain          | Required                       | Domain name                  | Share your partner sandbox store for testing purposes prior to launching your tax provider. Learn how to [create a partner sandbox store](https://developer.bigcommerce.com/api-docs/partner/getting-started/create-a-sandbox-store).                 | `https://sampletax-test-store.mybigcommerce.com/` |\n\n### Sandbox tax provider configuration\n\nSandbox tax provider configurations are nested within your production tax provider configuration, as such tax providers requiring a sandbox tax provider configuration should also provide details for their production tax provider configuration.\n\nAdditionally, when providing the details for a sandbox tax provider configuration, it's unnecessary to specify the below properties because they are inherited from the primary production tax provider configuration (all other properties are still required):\n\n* Merchant support email\n* Merchant support URL\n* Tax provider visibility\n* Platform availability, i.e. all stores or only specified store hashes\n* Supported / unsupported countries\n\n<div class=\"HubBlock--callout\">\n<div class=\"CalloutBlock--info\">\n<div class=\"HubBlock-content\">\n\n> ### Note\n> * We recommend tax providers request to create only one sandbox tax provider within their production tax provider configuration, any development procedures related to testing different estimate, commit, adjust and void Tax Provider API endpoints should be performed externally and decoupled from the BigCommerce platform to avoid unnecessary dependencies.\n\n</div>\n</div>\n</div>\n\n## Building the app\n\nTax providers are required to build a BigCommerce [single-click app](https://developer.bigcommerce.com/api-docs/apps/guide/types#single-click) in order to utilise the Tax Provider API to provide tax estimates and submit tax documents. A BigCommerce single-click app provides many benefits, for example, it enables tax providers to promote their solution in the BigCommerce apps marketplace, ask for merchant authorisation of API scopes during app install, as well as enable configuration of tax provider settings via an iFrame in the BigCommerce control panel.\n\nReview our [introduction to building apps](https://developer.bigcommerce.com/api-docs/apps/guide/intro) guide and use the sidebar to explore topics including: types of apps, managing apps in the dev portal, implementing OAuth, and designing the UI.\n\nMake sure to also review our [app development best practices](https://developer.bigcommerce.com/api-docs/apps/guide/best-practices) for some tips.\n\n<div class=\"HubBlock--callout\">\n<div class=\"CalloutBlock--info\">\n<div class=\"HubBlock-content\">\n\n> ### Note\n> * If you have registered your app in the Developer Portal but have not submitted it for approval because it's still in development, the app will be in a Draft state. This means your app can only be installed on stores owned by the same email address as the Developer Portal account email.\n\n</div>\n</div>\n</div>\n\n## Installing the app\n\nOnce the merchant clicks **Install** on a tax providers single-click app, it's essential the app successfully handles the OAuth flow before moving onto the next step of establishing a connection with the [Tax Provider API](https://developer.bigcommerce.com/api-reference/providers/tax-provider-api). This [OAuth summary](https://developer.bigcommerce.com/api-docs/apps/guide/auth#oauth-summary) provides an overview of the OAuth flow.\n\nWhen handling the OAuth flow, tax providers must ensure their app is requesting read and write permissions on the **Information and Settings** API scopes. Additionally, the tax provider should store the **client_id** and **access_token** that are received. Both are required later when [establishing a connection with the Tax Provider API](#establishing-a-connection-with-the-tax-provider-api).\n\n## Establishing a connection\n\nA tax provider is ready to establish a connection with the Tax Provider API when all of the below are true:\n\n* Tax provider has shared their tax provider details with BigCommerce via email, and we've replied confirming the tax provider configuration is now ready on all supplied merchant and/or partner test stores (see [Sharing provider details with BigCommerce](#sharing-provider-details-with-bigcommerce)).\n* BigCommerce has shared the `provider_id` of the tax provider configuration with the tax provider via email (see [Sharing provider details with BigCommerce](#sharing-provider-details-with-bigcommerce)).\n* Tax provider has built a draft app and it successfully handles the OAuth flow during app installation (see [Building the app](#building-the-app)).\n* During the OAuth flow the app requested the merchant to authorise read and write permissions on the Information and Settings API scopes (see [Installing the app](#installing-the-app)).\n* During the OAuth flow the `client_id` and `access_token` was received and stored by the tax provider (see [Installing the app](#installing-the-app)).\n\nFor context, the [Tax Provider API Connection endpoints](https://developer.bigcommerce.com/api-reference/store-management/tax) provide an added layer of security for tax providers. They're used to set basic authentication credentials for the tax provider and these basic credentials are used to authenticate each API request to the tax provider from the associated store.\n\nIf the tax provider supports all eligible stores, then they may choose to provide an account registration flow in their app iFrame in order to capture these basic authentication credentials from merchants. Learn more about designing the app UI [here](https://developer.bigcommerce.com/api-docs/apps/guide/ui).\n\nIf the tax provider is a private instance, then they may choose to provide the basic authentication credentials themselves.\n\nIn either case, the [Update Connection](https://developer.bigcommerce.com/api-reference/store-management/tax/tax-provider-connection/provider-connection-put) endpoint should be called after the tax provider's app has been successfully installed. Tax providers will need to include `store_hash`, `provider_id`, `X-Auth-Client` (`client_id`) and `X-Auth-Token`(`access_token`) values.\n\nWe recommend calling the [Update Connection](https://developer.bigcommerce.com/api-reference/store-management/tax/tax-provider-connection/provider-connection-put) endpoint immediately after the app has been successfully installed, otherwise your tax provider will not be displayed when merchants navigate to the **Store Setup > Tax** page in the BigCommerce control panel.\n\nThe [Get a Connection](https://developer.bigcommerce.com/api-reference/store-management/tax/tax-provider-connection/provider-connection-get) request may be used at any time to retrieve the connection status of the specified tax provider in the context of a store.\n\n## Enabling tax providers in the control panel\n\nOnce the tax provider's app has been successfully installed and basic authentication credentials have been provided via the Update a Connection request, users will be able to enable the tax provider on all supplied merchant and/or partner test stores provided by the tax provider in [sharing provider details with BigCommerce](#sharing-provider-details-with-bigcommerce).\n\nTo enable the tax provider, users must navigate to **Store Setup > Tax** in the BigCommerce control panel and click **Enable** next to the associated tax provider.\n\nIf document submission is supported, navigate to **Store Setup > Tax > {Tax Provider}** and ensure the submit order data checkbox is checked.\n\n## Tax estimation\n\n### When tax estimates are requested\n\nOnce the tax provider app has been enabled in the BigCommerce control panel, the tax provider is ready to respond to tax estimate requests sent by BigCommerce.\n\nTax estimates will be requested, depending on the BigCommerce store's settings, multiple times during a standard BigCommerce checkout flow.\n\n* After selecting a shipping method when using the **Estimate Shipping & Tax functionality** on the cart page\n* After specifying a shipping address during a checkout\n* After specifying a billing address during a checkout\n\nEstimate requests are not expected after the following events.\n\n* While browsing a store's product catalog or product pages.\n* On the cart page prior to a shopper selecting a shipping method using the **Estimate Shipping & Tax** functionality.\n* On the checkout page prior to specifying a shipping address.\n* On the checkout page, when toggling any option related to using the shopper's shipping address as their billing address.\n\nEstimate calls will also be made in the control panel when using flows like the following.\n\n* Line-item refund flows\n* Test connection functionality when users navigate to **Store Setup > Tax > {Tax Provider}** in the BigCommerce control panel\n\n<div class=\"HubBlock--callout\">\n<div class=\"CalloutBlock--info\">\n<div class=\"HubBlock-content\">\n\n> ### Note\n> * Tax estimate requests sent by BigCommerce may not always contain complete data as these requests will be fired at different stages of the shopper checkout. For example, the **Estimate Shipping & Tax** functionality on the cart page does not provide any billing address data, but the tax provider will still be expected to return a valid tax estimate.\n\n</div>\n</div>\n</div>\n\n### Responding to tax estimate requests\n\nWhen responding to tax estimate requests sent by BigCommerce, tax providers are required to include aggregates and breakdowns of sales tax amounts and rates for product item prices, shipping and handling prices. This is because when navigating to the **Store Setup > Tax > Tax Settings** page in the BigCommerce control panel, merchants have the ability to specify whether they would like to show taxes in cart, checkout, orders and invoice **As one summarized line item** or **Broken down by tax rate**.\n\n[View the Estimate Taxes API reference](https://developer.bigcommerce.com/api-reference/providers/tax-provider-api/tax-provider/estimate).\n\n## Document submission\n\nDocument submission enables tax providers to persist a tax quote request, replace it with another one, or invalidate it if necessary.\n\nSupporting document submission is optional. However, tax providers wishing to support this functionality must share document submission URLs with BigCommerce when [sharing provider details with BigCommerce](#sharing-provider-details-with-bigcommerce).\n\nIf document submission is supported, navigate to **Store Setup > Tax > {Tax Provider}** and ensure the submit order data checkbox is checked.\n\n[View the Commit Tax Quote API reference](https://developer.bigcommerce.com/api-reference/providers/tax-provider-api/tax-provider/commit).\n\n## Testing\n\nPrior to testing a tax provider, the merchant or partner test store should have the following configured in the BigCommerce control panel:\n\n* The store default country, found by navigating to **Store Setup > Store Profile**, is set to a country that is supported by the tax provider\n* The shipping origin address, found by navigating to **Store Setup > Shipping**, is configured. This value is included in tax estimate requests\n* The tax provider, found by navigating to **Store Setup > Tax**, is enabled\n* If document submission is supported, navigate to **Store Setup > Tax > {Tax Provider}** and ensure the submit order data checkbox is checked\n\nTo test the tax provider connection, navigate to **Store Setup > Tax > {Tax Provider}** in the BigCommerce control panel and click **Test Connection**. This will trigger a sample tax estimate request to be sent to the estimate URL provided by the tax provider. If the connection is unsuccessful, users can navigate to **Server Settings > Store Logs** in the BigCommerce control panel to view the error and it’s description to assist with triaging the issue.\n\n## Support\n\nFor anything related to the BigCommerce app, please raise a ticket using your [BigCommerce dev tools portal](https://devtools.bigcommerce.com/).\n\nRefer to our [Tax Provider API reference](https://developer.bigcommerce.com/api-reference/providers/tax-provider-api) here for a complete API description.\n\nFor Tax Provider API related questions, or to request set up of a new tax provider configuration, email [taxproviderapi@bigcommerce.com](mailto:taxproviderapi@bigcommerce.com).\n\n## Related resources\n\n### Articles\n\n* [Building Apps Guide](https://developer.bigcommerce.com/api-docs/apps/guide/intro)\n\n### Endpoints\n\n  - [Tax Provider API Reference](https://developer.bigcommerce.com/api-reference/providers/tax-provider-api)\n  - [Get a Tax Provider Connection](https://developer.bigcommerce.com/api-reference/store-management/tax/tax-provider-connection/provider-connection-get)\n  - [Delete a Tax Provider Connection](https://developer.bigcommerce.com/api-reference/store-management/tax/tax-provider-connection/provider-connection-delete)\n  - [Update a Tax Provider Connection](https://developer.bigcommerce.com/api-reference/store-management/tax/tax-provider-connection/provider-connection-put)\n  - [Tax Classes](https://developer.bigcommerce.com/api-reference/store-management/tax-classes-api)\n"}],"children":[]}}}}
