{"path":"stencil-docs/getting-started/transitioning-to-stencil","templateID":0,"sharedPropsHashes":{"nav":"Z2k7O5R","sidebarTree":"23J4Lj","namespace":"Zd6xn0"},"localProps":{"version":"1.3","crumbs":[{"content":"Stencil Docs","to":"/stencil-docs"},{"content":"Getting Started","to":"/stencil-docs/getting-started"},{"content":"Transitioning to Stencil","to":"/stencil-docs/getting-started/transitioning-to-stencil"}],"page":{"meta":{"title":"Transitioning to Stencil - Getting Started - Stencil Docs","url":"/stencil-docs/getting-started/transitioning-to-stencil","description":"Transitioning to Stencil\n\n\n\nOn this page\n\nWhat is Stencil?\n\nWhy transition to Stencil?\n\nTechnical differences\n\nDeveloping locally on Stencil CLI\n\nUsing ..."},"title":"Transitioning to Stencil","parsedPath":["pages","/stencil-docs","data","children",0,"data","children",2],"rootPagePath":"/stencil-docs","path":"/stencil-docs/getting-started/transitioning-to-stencil","isSubpage":true,"route":{"path":"/transitioning-to-stencil"},"data":{"blocks":[{"type":"text","data":"# Transitioning to Stencil\r\n\r\n<div class=\"otp\" id=\"no-index\">\r\n\r\n### On this page\r\n- [What is Stencil?](#what-is-stencil)\r\n- [Why transition to Stencil?](#why-transition-to-stencil)\r\n- [Technical differences](#technical-differences)\r\n  - [Developing locally on Stencil CLI](#developing-locally-on-stencil-cli)\r\n  - [Using Handlebars](#using-handlebars)\r\n  - [Customize Page Builder mode](#customize-page-builder-mode)\r\n  - [Create custom templates](#create-custom-templates)\r\n- [Resources](#resources)\r\n\r\n</div>\r\n\r\nThis article outlines the key differences between Blueprint and Stencil for developers, agency partners, and anyone interested in Stencil's enhanced capabilities.\r\n\r\n##  What is Stencil?\r\n\r\n[Stencil](https://developer.bigcommerce.com/stencil-docs/getting-started/about-stencil) is BigCommerce’s latest theme framework engine. Launched in 2016, Stencil incorporates industry best practices in technology, design standards, and SEO. You can use the framework’s theme on mobile, tablet, and desktop browsers. Stencil also allows developers to build storefronts that engage shoppers and encourage checkouts on any device. All of BigCommerce’s new storefronts use Stencil.\r\n\r\nIf you are still using our legacy theme framework, Blueprint, we highly encourage switching to Stencil so you can take advantage of the new features and benefits. For more in-depth information about Stencil’s features, see the [Stencil Theme Platform](https://support.bigcommerce.com/s/article/The-Stencil-Theme-Platform#features) page.\r\n\r\n## Why transition to Stencil?\r\n\r\nStencil improves the overall storefront experience for merchants and their customers. With enhancements in speed, security, and updates to your themes, this modern framework provides a more streamlined process for the everyday maintenance and tasks required to run a store.\r\n\r\nStencil themes are built on non-proprietary, open-source code to provide easier adoption and adaptation while providing greater flexibility and access for customization. In comparison, Blueprint is built on a rigid, proprietary codebase, making it difficult to tailor and extend theme functionality.\r\n\r\nFor more information on the enhanced capabilities of Stencil, see the [Stencil vs. Legacy Blueprint](https://support.bigcommerce.com/s/article/The-Stencil-Theme-Platform#compare) page.\r\n\r\n## Technical differences\r\n\r\nWhen transitioning any store from Blueprint to Stencil, you should be aware of a few key differences. Transitioning to Stencil allows developers to do the following:\r\n- [Develop locally on Stencil CLI](#developing-locally-on-stencil-cli)\r\n- [Use Handlebars instead of global variables](#use-handlebars)\r\n- [Customize Page Builder mode](#customize-page-builder-mode)\r\n- [Create custom templates](#create-custom-templates)\r\n\r\n\r\n### Developing locally on Stencil CLI\r\n\r\nFor complete control over a theme’s appearance, logic, and theme configuration files, developers can use the Stencil command line interface (Stencil CLI). This interface allows you to design and preview storefronts locally before pushing them to production. Access to real-time previews and testing across various devices is available via [Browsersync](https://www.browsersync.io/), a browser testing assistant built into Stencil CLI.\r\n\r\n\r\nWhile Blueprint themes allow users to add new files and assets to themes via WebDav, Stencil assets must be added to and bundled into the theme, or referenced from an external source.\r\n\r\nFor images referenced from anywhere in your Blueprint file directory, you will need to move these assets to your Stencil theme and reference them appropriately. You can still reference assets from within the `/content/` folder in WebDav or from an external source.\r\n\r\nFor more information on Stencil theme assets, see the [Theme Assets](https://developer.bigcommerce.com/stencil-docs/storefront-customization/theme-assets) page.\r\n\r\n### Using Handlebars\r\n\r\n\r\nWhile PHP variables enclosed within `%%` markers represent dynamic content, [Handlebars](https://handlebarsjs.com/), a JavaScript templating language represents BigCommerce dynamic stored data in Stencil themes.\r\n\r\nHandlebars keeps your HTML page clean by separating the logic-less templates from the business logic in your JavaScript files. This organization improves the structure of the application, promoting maintainability and scalability. Handlebars also simplifies the task of manually updating data in the customer-facing display view.\r\n\r\n\r\nFor more information about Handlebars, refer to these external resources:\r\n- [A Beginner’s Guide to Handlebars](https://www.sitepoint.com/a-beginners-guide-to-handlebars/)\r\n- [Getting Started with Handlebars.js](http://blog.teamtreehouse.com/getting-started-with-handlebars-js)\r\n- [Handlebars interactive tutorial](http://tryhandlebarsjs.com/)\r\n\r\nFor details on using Handlebars to surface objects in Stencil, see [Stencil Technology Stack](https://developer.bigcommerce.com/stencil-docs/getting-started/stencil-technology-stack).\r\n\r\n### Customize Page Builder mode\r\n\r\nWhile Blueprint uses Style Editor to customize legacy themes, Stencil uses Page Builder. [Page Builder](https://support.bigcommerce.com/s/article/Page-Builder) is BigCommerce's browser-based tool that enables merchants to rapidly modify and customize a storefront's look and feel without writing code. Stencil theme developers can configure settings for Page Builder. The configuration determines the theme's customizable aspects.\r\n\r\nFor example, by customizing the configuration of Page Builder, you can modify how merchants customize colors, fonts, display of page features, and the number of products displayed per feature.\r\n\r\nWhen you switch to Stencil from Blueprint, you won’t lose any of your store data. However, you will lose any customization you’ve hardcoded into your previous Blueprint theme.\r\n\r\n### Create custom templates\r\n\r\nStencil allows theme developers and merchants to assign custom layout templates to the following types of storefront pages:\r\n- Brand (unique to Stencil)\r\n- Category\r\n- Product\r\n- Store (static page)\r\n\r\nUnlike Blueprint, Stencil does not require that custom template file names start with an underscore. In the current Stencil release, you must create and bundle custom templates using Stencil CLI before uploading the custom templates to stores. However, once you have created and uploaded templates, authorized store users can assign them to storefront pages through the control panel. For more information on custom templates, see the [Custom Templates](https://developer.bigcommerce.com/stencil-docs/storefront-customization/custom-templates) page.\r\n\r\n### Resources\r\n\r\nFor more information about switching to Stencil, see the following resources:\r\n- [Getting Started with the Stencil Framework - Youtube Playlist](https://www.youtube.com/watch?v=s5_GjU51h-w&list=PLwTYtMwfzbe7EZiIWPAmPtuwRHkY7BG-0&index=1)\r\n- [Stencil Theme Editor](https://support.bigcommerce.com/s/article/Stencil-Themes)\r\n- [Editing Stencil Theme Files](https://support.bigcommerce.com/s/article/Stencil-Themes#edit)\r\n- [Personalizing Your Stencil Theme](https://support.bigcommerce.com/articles/Learning/Personalizing-your-New-Theme)\r\n- [What to Consider When Changing Your Stencil Theme](https://support.bigcommerce.com/s/article/What-to-Consider-When-Changing-Your-Theme)\r\n"}],"children":[]}}}}
