{"path":"api-docs/getting-started/best-practices","templateID":0,"sharedPropsHashes":{"nav":"Z2k7O5R","sidebarTree":"Z1Jm3fi","namespace":"Zd6xn0"},"localProps":{"version":"1.3","crumbs":[{"content":"API Docs","to":"/api-docs"},{"content":"Getting Started","to":"/api-docs/getting-started"},{"content":"Best Practices","to":"/api-docs/getting-started/best-practices"}],"page":{"meta":{"title":"Best Practices - Getting Started - API Docs","url":"/api-docs/getting-started/best-practices","description":"API Best Practices\n\n\n\nOn this page\n\nEnsure your integration is up-to-date\n\nAnticipate changes to BigCommerce APIs\n\nUse webhooks effectively\n\nThread API ..."},"title":"Best Practices","parsedPath":["pages","/api-docs","data","children",0,"data","children",4],"rootPagePath":"/api-docs","path":"/api-docs/getting-started/best-practices","isSubpage":true,"route":{"path":"/best-practices"},"data":{"blocks":[{"type":"text","data":"# API Best Practices\r\n\r\n<div class=\"otp\" id=\"no-index\">\r\n\r\n### On this page\r\n- [Ensure your integration is up-to-date](#ensure-your-integration-is-up-to-date)\r\n- [Anticipate changes to BigCommerce APIs](#anticipate-changes-to-bigcommerce-apis)\r\n- [Use webhooks effectively](#use-webhooks-effectively)\r\n- [Thread API requests](#thread-api-requests)\r\n- [Marketplace apps](#marketplace-apps)\r\n- [API rate limits](#api-rate-limits)\r\n- [Platform limits](#platform-limits)\r\n- [Resources](#resources)\r\n\r\n</div>\r\n\r\n## Ensure your integration is up-to-date\r\n\r\nBigCommerce frequently enhances its core product and is actively developing v3 API endpoints. By using the newest API version, you will ensure that your app has access to the latest resources. You will also be better positioned to provide a user experience consistent with what merchants will see in their BigCommerce store’s control panel. To stay up to date, bookmark our [changelog](/changelog).\r\n\r\n## Anticipate changes to BigCommerce APIs\r\n\r\nAt BigCommerce, we make a distinction between \"breaking\" and \"non-breaking\" changes. \r\n\r\nAny \"breaking\" changes listed below will always be made with early warning via our developer [changelog](/changelog) and other channels. There are several exceptional cases. BigCommerce will make breaking changes without warning to non-production (alpha/beta) APIs, or when we know the usage of a particular endpoint is zero.\r\n\r\nBreaking changes:\r\n\r\n\r\n- Removal of a field from an API response\r\n- Changing the data type of a field\r\n- Changing the structure of an object\r\n- Removal of an entire endpoint\r\n- Adding a new required field to a `POST`/`PUT` body\r\n\r\nWe encourage developers to write code against our APIs that will not break if an endpoint begins returning additional fields. We will push these \"non-breaking\" changes to the code base without warning as part of our normal development.\r\n\r\nNon-breaking changes:\r\n\r\n- Adding a new field to a `GET` response\r\n- Adding a new optional field to a `POST`/`PUT` body\r\n- Adding new endpoints\r\n\r\n## Use webhooks effectively\r\n\r\nTo keep data in your application up-to-date, [webhooks](/api-docs/getting-started/webhooks/about-webhooks) provide a great alternative to periodic API polling. Use OAuth to register a webhook event that your application can listen for. Do not use legacy [basic authentication](/api-docs/getting-started/authentication/rest-api-authentication#migrating-from-legacy-to-oauth/) for this.\r\n\r\nBigCommerce will send a partial payload when a subscribed event is triggered, with a few identifying details such as the order ID when an order is created. Your application can use the order ID returned in the payload to make a subsequent API request for the full order details.\r\n\r\n\r\n## Thread API requests\r\n\r\nYou can use threaded requests in order to quickly update information in an API. Threaded requests allow you to send multiple requests at one time. They can come from a different open connection or multiple requests to the same resource.\r\n\r\nThe [BigCommerce Ruby API](https://github.com/bigcommerce/bigcommerce-api-ruby) client is thread-safe. It satisfies the need for multiple threads to access the same shared data and the need for only one thread to access a shared piece of data at any given time. These attributes can reduce the total time that your app will require to complete a series of requests.\r\n\r\n## Marketplace apps\r\n\r\nMerchants often have more than one person who can access a store's control panel. BigCommerce allows additional users to access an app when the store owner has granted them appropriate permissions. The requirements for supporting multi-user app access are:\r\n* Tokens must be stored against the `store_hash` and not against user info.\r\n* Within the [Developer Portal](https://developer.bigcommerce.com/api-docs/getting-started/authentication/rest-api-authentication#obtaining-app-api-credentials) workspace, you must enable your app’s **Technical** > **Multiple Users** option.\r\n\r\nIn the payload returned when a user launches an app, users are distinguished by `owner_email` versus `user_email`. If these two emails match, the user is the store owner.\r\n\r\nIf you wish to enable user removal, you can do so by filling in your app’s **Technical** > **Remove User Callback URL** field in the Developer Portal. Enabling user removal is optional. For more advanced implementations, you can enable the store owner to grant specific permissions to different non-admin users. For example, `person1@email.com` could be restricted to only editing product inventory but not viewing orders. If you decide to include user permission in your app, it’s a great feature to advertise.\r\n\r\nFor more information, see [Multi-User Support](/api-docs/apps/guide/intro#multi-user-support).\r\n\r\n## API rate limits\r\nApps that authenticate with OAuth are rate-limited based on a quota that is refreshed every few seconds. The maximum quota for a store will vary depending on the [store’s plan](https://support.bigcommerce.com/s/article/Platform-Limits#storelimits).\r\n\r\n| Plans & sandboxes | Maximum quota |\r\n| -- | -- | \r\n| Enterprise plans and Enterprise sandboxes (Enterprise-Test) | Unlimited\\*| \r\n| Pro plans| 60k per hour (450 / 30sec) | \r\n| All other sandboxes (Dev/Partner/Employee) | 20k per hour (150 / 30sec)| \r\n| Plus & Standard plans| 20k per hour (150 / 30sec) | \r\n\r\n<div class=\"HubBlock--callout\">\r\n<div class=\"CalloutBlock--info\">\r\n<div class=\"HubBlock-content\">\r\n\r\n### Note\r\nThe **Unlimited** rate limit on BigCommerce Enterprise plans means that stores on this plan will not be artificially rate-limited on the basis of API-requests-per-unit-of-time. However, there are physical limits to the infrastructure which may limit the maximum throughput of requests on any given API endpoint. BigCommerce also reserves the right to limit unreasonable or abusive API activity in the interest of platform stability, per our [Terms of Service](https://www.bigcommerce.com/terms/api-terms/).\r\n\r\n</div>\r\n</div>\r\n</div>\r\n\r\n\r\nEach request to the API consumes one available request from the quota. When an app hits the quota limit, subsequent requests are rejected until the quota is refreshed.\r\n\r\nThe store’s overall quota is distributed across all apps that are accessing the store at a given time. This provides fairness for multiple apps that are accessing the API simultaneously, preventing a single app from consuming the store’s entire quota by itself. The quota might adjust as additional clients connect or disconnect while you’re running requests.\r\n\r\n### Concurrent API call rate limits\r\n\r\nCertain BigCommerce API resources rate-limit concurrent requests. This is to ensure the performance and reliability of the platform for all of our users. API calls are metered on a per-store, per-endpoint basis. These limitations are subject to change.\r\n\r\n| Limit | Endpoint | Method |\r\n| -- | -- | -- |\r\n| 10| `/stores/:hash/v3/customers` | `POST` |\r\n\r\n\r\n### Playing nicely with the platform\r\n\r\nEvery API response’s HTTP headers give you full visibility into your position in the rate-limiting algorithm:\r\n\r\n```http\r\nX-Rate-Limit-Requests-Left →6\r\nX-Rate-Limit-Requests-Quota →25\r\nX-Rate-Limit-Time-Reset-Ms →3000\r\nX-Rate-Limit-Time-Window-Ms →5000\r\n```\r\n\r\n| Name | Description |\r\n| -- | -- |\r\n| `X-Rate-Limit-Time-Window-Ms`| Shows the size of your current rate limiting window. In this case, it’s 5000 milliseconds.|\r\n| `X-Rate-Limit-Time-Reset-Ms` | Shows how many milliseconds are remaining in the window. In this case, 3000 milliseconds. 3000 milliseconds after this request, the API quota will be refreshed. |\r\n| `X-Rate-Limit-Requests-Quota` | Shows how many API requests are allowed in the current window for your client. In this case, the number is 25 requests. |\r\n| `X-Rate-Limit-Requests-Left` | Details how many remaining requests your client can make in the current window before being rate limited. In this case, you would expect to be able to make 6 more requests in the next 3000 milliseconds; on the 7th request within 3000 milliseconds, you would be rate limited and would receive an HTTP 429 response.|\r\n\r\nYou will know you've been limited if your request to the API triggers a [429 Too Many Requests](/api-docs/getting-started/basics/api-status-codes#api-status-codes_4-client-error) response.\r\n\r\nThe rate limited response will contain the `X-Rate-Limit-Time-Reset-Ms` header, specifying a time (in milliseconds) that your client must wait before its quota has refreshed. Retry the request after this time has elapsed, and your API service will resume as normal.\r\n\r\n### Example of 429 status code\r\n\r\nWhen you see a response with an HTTP `429` status code, your client shouldn’t make any further requests until your quota has refreshed:\r\n\r\n**429 response**\r\n\r\n```http\r\nHTTP/1.1 429 Too Many Requests\r\n    \tDate: Mon, 03 Feb 2017 20:36:00 GMT\r\n    \tContent-Type: application/json\r\n    \tX-Rate-Limit-Time-Reset-Ms: 15000\r\n```\r\n\r\nParse the `X-Rate-Limit-Time-Reset-Ms` header to determine how long you have to wait. In this case, it would be 15000 milliseconds.\r\nYour client can sleep on the specified interval:\r\n\r\n**PHP example for delaying response**\r\n```php\r\n   $milliseconds = $response->getHeader(\"X-Rate-Limit-Time-Reset-Ms\");\r\n    usleep($milliseconds * 1000);\r\n```\r\n\r\nAfter waiting for the given number of milliseconds, your client can go back to making API requests.\r\n\r\n### Making requests in parallel\r\nYou might wish to increase the amount of work your application can do in a given unit of time by sending multiple HTTP requests to the BigCommerce API in parallel. This is perfectly acceptable. However, your application should monitor the rate limiting headers to avoid an HTTP `429` response. Methods for doing this include:\r\n* Slowing your rate of API requests when `X-Rate-Limit-Requests-Left` is nearing zero.\r\n* Determining an acceptable average rate of requests, by dividing `X-Rate-Limit-Requests-Quota` by `X-Rate-Limit-Time-Window-Seconds`, and then self-throttling to that rate.\r\n\r\n<div class=\"HubBlock--callout\">\r\n<div class=\"CalloutBlock--warning\">\r\n<div class=\"HubBlock-content\">\r\n\r\n<!-- theme: warning -->\r\n\r\n### Note\r\n> Endpoints that accept bulk requests may have specific limitations on the number of accepted parallel requests. For example, making multiple parallel `upsert` requests to [`/pricelists/{price_list_id}/records`](/api-reference/store-management/price-lists/price-lists-records/setpricelistrecordcollection) will result in a `429` error response -- these limitations are documented at the operation level in the API reference.\r\n\r\n</div>\r\n</div>\r\n</div>\r\n\r\n### Making requests with the Storefront Cart API \r\nClient-side applications should avoid polling the [Storefront Cart API](https://developer.bigcommerce.com/api-reference/cart-checkout/storefront-cart-api) on interval. Hundreds of thousands of browsers could potentially poll the Storefront Cart API at any given time, causing a significant load increase to BigCommerce's servers. We may take action against a store using this practice to prevent interruptions in service to other stores.\r\n\r\nConsider subscribing to the [Cart Webhook](https://developer.bigcommerce.com/api-docs/getting-started/webhooks/webhook-events#cart) via a server-side application as an alternative to polling the Storefront Cart API at an interval, and only query the Storefront Cart API as a response to user input. Storing cart information in the browser cache is also an alternative method for keeping cart information up to date across browser tabs.\r\n\r\n## Platform limits\r\n\r\nBigCommerce does have limits on the number of products, categories, brands, etc. that can be created in a store. See [Platform Limits](https://support.bigcommerce.com/s/article/Platform-Limits) for more details.\r\n\r\n## Resources\r\n### Related articles\r\n* [API Status Codes](https://developer.bigcommerce.com/api-docs/getting-started/api-status-codes)\r\n* [Filtering](https://developer.bigcommerce.com/api-docs/getting-started/filtering)\r\n* [Platform Limits](https://support.bigcommerce.com/s/article/Platform-Limits)\r\n"}],"children":[]}}}}
