{"path":"api-docs/multi-currency/guide/introduction","templateID":0,"sharedPropsHashes":{"nav":"Z2k7O5R","sidebarTree":"Z1Jm3fi","namespace":"Zd6xn0"},"localProps":{"version":"1.3","crumbs":[{"content":"API Docs","to":"/api-docs"},{"content":"Managing Currencies","to":"/api-docs/multi-currency"},{"content":"Guide","to":"/api-docs/multi-currency/guide"},{"content":"Introduction","to":"/api-docs/multi-currency/guide/introduction"}],"page":{"meta":{"title":"Introduction - Guide - Managing Currencies - API Docs","url":"/api-docs/multi-currency/guide/introduction","description":"Currencies Overview\n\n\n\nOn this Page\n\nDisplay vs. transactional\n\nPreconfiguring the store\n\nAdding a currency\n\nHow currencies work\n\nSupported and unsuppor..."},"title":"Introduction","parsedPath":["pages","/api-docs","data","children",8,"data","children",0,"data","children",0],"rootPagePath":"/api-docs","path":"/api-docs/multi-currency/guide/introduction","isSubpage":true,"route":{"path":"/introduction"},"data":{"blocks":[{"type":"text","data":"# Currencies Overview\n\n<div class=\"otp\" id=\"no-index\">\n\n### On this Page\n- [Display vs. transactional](#display-vs-transactional)\n- [Preconfiguring the store](#preconfiguring-the-store)\n- [Adding a currency](#adding-a-currency)\n- [How currencies work](#how-currencies-work)\n- [Supported and unsupported features](#supported-and-unsupported-features)\n- [Multi-currency definitions](#multi-currency-definitions)\n- [FAQ](#faq)\n- [Related resources](#related-resources)\n\n</div>\n\nBigCommerce’s flexible Currency settings assist developers in building Multi-Currency storefronts that empower shoppers and merchants to do business in their currency of choice. Allowing customers to shop and check out in their native currency provides a more consistent and positive shopping experience, and maintaining price expectations throughout the shopping process encourages conversions for merchants.\n\nThis article provides a high-level guide to multi-currency concepts in BigCommerce as well as specific instructions on [adding currencies](#adding-a-currency) via the control panel. For additional details on how currencies are surfaced throughout BigCommerce APIs, user interfaces, and storefront components, see [How Currencies Works](https://developer.bigcommerce.com/api-docs/catalog/currencies/how-currencies-work).\n\n## Display vs. Transactional\n\n<a id=\"display-vs-transactional-currencies\"></a>\n\nIn BigCommerce, there are two types of currency that can be set up: a **display currency** and **transactional currency**.\n\n* **Display currency** - When a currency is set to display-only, shoppers in associated countries will see prices on the storefront in that currency, but the actual order will be transacted in the store’s default currency. Shoppers at checkout see the estimated price in the display currency with a note indicating the actual currency and amount to be charged.\n\n* **Transactional currency** - When a currency is set as transactional, shoppers in associated countries will both see prices on the storefront in that currency and be charged in that currency when they check out.\n\n![Display Currency](https://raw.githubusercontent.com/bigcommerce/dev-docs/master/assets/images/multi-currency-display-currency.png \"Display Currency\")\n\n<div class=\"HubBlock--callout\">\n<div class=\"CalloutBlock--info\">\n<div class=\"HubBlock-content\">\n\n<!-- theme: info -->\n\n### Note\n> * If the shopper’s card-issuing bank differs from the merchant's bank account country, additional cross-border fees may apply that can change the final settlement amount.\n> * You can choose whether a currency should be display-only or transactional when adding or editing a currency.\n\n</div>\n</div>\n</div>\n\n## Preconfiguring the store\n\n<a id=\"preconfiguring-the-store\"></a>\n\nBefore setting up multiple currencies on a store, ensure your store is using the following:\n* A [Stencil theme](https://developer.bigcommerce.com/stencil-docs/getting-started/about-stencil).\n* The [Optimized One-Page Checkout](https://support.bigcommerce.com/s/article/Optimized-Single-Page-Checkout) type.\n* A [multi-currency compatible payment gateway](https://support.bigcommerce.com/s/article/Managing-Currencies) set up and enabled. (Your store's default currency can use any gateway).\n\nAdditionally, review the [Currency API reference](https://developer.bigcommerce.com/api-reference/store-management/currency-api) to get aquainted with the endpoints and resources related to configuring multiple currencies.\n\n<div class=\"HubBlock--callout\">\n<div class=\"CalloutBlock--info\">\n<div class=\"HubBlock-content\">\n\n<!-- theme: info -->\n\n### Note \n>Make sure to not change the store’s default currency. This could cause the currency to malfunction.\n\n</div>\n</div>\n</div>\n\n## Adding a currency\n\n<a id=\"adding-a-currency\"></a>\n\nTransactional currencies can't be created via API, so they'll need to be added via the control panel. To do so:\n\n1. Navigate to **Store Setup > Currencies**, then select **Add a Currency...**\n2. Select the currency code that corresponds to the currency you want to set up, then click **Next**.\n3. Configure the currency’s display and transactional settings.\n4. Click **Save**.\n\nFor more in-depth instructions and helpful screenshots, see [Adding a Currency](https://support.bigcommerce.com/s/article/Managing-Currencies-Beta#add) in the Help Center.\n\n<div class=\"HubBlock--callout\">\n<div class=\"CalloutBlock--error\">\n<div class=\"HubBlock-content\">\n\n<!-- theme: error -->\n\n### Note\n> Do not change the default currency -- this may lead to unintended currency conversion issues.\nFor instance, changing the default currency will not trigger price recalculation for the catalog.\nAdditionally, changing the default currency will enable the newly assigned currency as transactional.\n\n\n</div>\n</div>\n</div>\n\n## How currencies work\n\n<a id=\"how-currencies-work\"></a>\n\nFor details on how currencies are surfaced throughout BigCommerce APIs, user interfaces, and storefront components, see [How Currencies Works](https://developer.bigcommerce.com/api-docs/catalog/currencies/how-currencies-work)\n\n## Supported and unsupported features\n\n<a id=\"supported-and-unsupported-features\"></a>\n\nSee the table below for a list of supported and unsupported features.\n\n| Supported                                    | Not Supported                                  |\n|----------------------------------------------|------------------------------------------------|\n| Optimized One-Page Checkout                  | Legacy Checkout                                |\n| Stencil Themes                               | Legacy Blueprint Themes                        |\n| Stripe Payment Gateway                       | Other Payment Gateways                         |\n| Store credit in default currency             | Store credit in display currencies             |\n| Customer group discounts in default currency | Customer group discounts in display currencies |\n| Discounts created through Promotions         | Legacy coupon codes                            |\n| Storefront Elasticsearch                     |                                                |\n| Storefront product filtering                 |                                                |\n\n## Multi-currency definitions\n\n<a id=\"multi-currency-definitions\"></a>\n\n| Name | Description |\n| -- | -- |\n| Default Currency | Merchants use this currency when any auto-conversion of pricing (product, tax, shipping, promotions) occurs.|\n| Display Currency | When a merchant displays prices in a currency on a storefront in which the shopper might or might not use to perform a transaction. Display currency is also often called \"presentment currency\" in the payments industry.  |\n| Transactional Currency | Comprised of the currency and amount, the transactional currency is what BC passes to the payment provider and what is charged to a shopper's bank account. If there's a discrepancy between the storefront display currency and the transactional currency, a shopper has to pay a conversion fee and the conversion rate used is outside of BC's scope.  |\n| Settlement Currency | The currency the merchant gets paid out to their bank account. If there's a discrepancy between the currency that a shopper transacts in and the currency in which a merchant settles, the merchant has to pay a conversion fee, and the conversion rate used is outside of BC's scope. The merchant can set their settlement currency through its payment provider.  |\n|BigCommerce Conversion Rate | Any conversion rate set on BigCommerce used to convert the product’s default currency pricing into a new non-default currency. The conversion rate can be static or dynamic. |\n| Static Conversion Rate | One of the two auto-converted pricing options. If a merchant manually enters a static conversion rate, then the conversion rate will remain the same until and unless the merchant updates their currency settings to use a different conversion rate. Using this method avoids constantly fluctuating prices in non-default currencies. |\n| Dynamic Conversion Rate | One of the two auto-converted pricing options. If a merchant selects a dynamic conversion rate, they've tied themselves to a currency-conversion service, which will update the conversion rate at a certain frequency. This helps shopper-facing pricing remain most aligned to the store's default currency and keeps the non-default currency conversion rate at market rate. The Merchant can either use BigCommerce Currency Service provided in the Currency setup page, or they can use the API to automatically update the exchange rate from their trusted source. |\n| Bank Conversion Rate | Conversion rate is used by merchants' or shoppers' payment or credit card providers when auto-converting from store's transactional currency. This rate might not align with the BC conversion rate, and BC has no visibility into it. |\n| Multi-Currency Pricing | Rather than opting for auto-converting product pricing from default currency using the BigCommerce Conversion Rate, the merchant has a choice to set price per product per currency. You can implement multi-currency pricing through price lists. |\n\n## FAQ\n\n<a id=\"faq\"></a>\n\n**Do Multi-Currency settings work with the Checkout SDK?**\n\nThe Checkout SDK works with multi-currency. There is no additional setup needed for the SDK. After setting up currency in the Control Panel the SDK will work as normal.\n\n**Do my theme customizations work with Multi-Currency Settings?**\n\nIf the theme is set up to show the currency on the storefront, there should be no issues. Please see your theme developer if that is not the case.\n\n**Can shoppers still select a currency?**\n\nShoppers will still be able to select their currency of choice on the storefront. This will depend on the stores themes and customizations.\n\n**Will my analytics show in the transactional or display currency?**\n\nAnalytics shows an approximate price in the store's default currency. This is based on the configured exchange rate. There is no abandoned cart analytics or web analytics such as Google Analytics. Currently, it does not break down analytics by currency.\n\n**How can I setup settlement currencies in Stripe?**\n\nPlease reach out to Stripe for more information on setting up the account.\n[Supported Settlement Currencies](https://stripe.com/docs/connect/payouts#supported-settlement) (Stripe Documentation)\n\n## Related resources\n\n### Articles\n- [How Currencies Works](https://developer.bigcommerce.com/api-docs/catalog/currencies/how-currencies-work)\n- [Using Price Lists](https://support.bigcommerce.com/s/article/Price-Lists)\n- [Managing Currencies](https://support.bigcommerce.com/s/article/Managing-Currencies-Beta)\n- [Tax](https://support.bigcommerce.com/s/article/Manual-Tax-Setup#intro1) \n- [Supported Currencies](https://stripe.com/docs/currencies)\n- [Supported Settlement Currencies](https://stripe.com/docs/connect/payouts#supported-settlement)\n\n### Endpoints\n- [Currency API](https://developer.bigcommerce.com/api-reference/store-management/currency-api)\n- [Price List API](https://developer.bigcommerce.com/api-reference/catalog/pricelists-api)\n"}],"children":[]}}}}
